# IFCDataPrimitiveType Enumeration (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
IFCDataPrimitiveType Enumeration
See Also
---
Used in operations to specify the primitive type of an IFCData.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public enum IFCDataPrimitiveType
```

Visual Basic
---
```text
Public Enumeration IFCDataPrimitiveType
```

Visual C++
---
```text
public enum class IFCDataPrimitiveType
```

# Members
| Member name | Description |
| --- | --- |
| --- | --- |
| Integer | Integer. |
| Double | Double. |
| Boolean | Boolean. |
| Logical | IFCLogical type. |
| String | String. |
| Binary | Binary. When reading or writing an IFCData of primitive type Binary, the value will be the string representation of the binary value as seen in the IFC specification. |
| Enumeration | Enumeration. When reading or writing an IFCData of primitive type Enumeration, the value will be the string representation of the enumeration value as seen in the IFC specification. |
| Instance | Represents IFCAnyHandle. |
| Aggregate | Represents IFCAggregate. |
| Unknown | Unknown. |

# See Also
Autodesk.Revit.DB.IFC Namespace